{"/hope-harmony/about/":{"data":{"":"Hope \u0026 Harmony is the official newsletter of Mary Elizabeth Baptist Church. The vision of this newsletter is to provide engaging and informative content about our church. The goal is to create a sense of community and connection. Everything featured in our newsletter is in the context of Christian faith. Guest authors, interviews, scripture, and fun pieces will culminate in a publication that will reveal the hearts and minds of our congregation, inform our members and community, and serve as a blessing for someone."},"title":"About"},"/hope-harmony/docs/":{"data":{"":" November 2024 October 2024 "},"title":"Newsletter"},"/hope-harmony/docs/november-2024/":{"data":{"":"","a-thankful-spirit-is-a-healthy-spirit#A Thankful Spirit is a Healthy Spirit":"Thanksgiving is a wonderful time to express gratitude and reflect upon our blessings, but there are physical and spiritual benefits to having a thankful heart all year. When we take the time to appreciate our blessings and give thanks, there are positive changes in our lives. We can introduce more gratitude in our daily life instead of reserving it for one Thursday in November.\nAccording to an article from the Mayo Clinic Health System, a positive association between various areas of health and gratitude has been noted in several studies. These include improved sleep and mood, as well as decreased anxiety, depression, and morbidity.\nAn article from UCLA Health states grateful people are more satisfied with their lives, have better relationships, and have higher self-esteem. There are physiological impacts of gratitude including improved blood pressure, decreased risk of heart disease, and lower stress. Oxytocin, a hormone that builds positive connections between people and has an overall calming effect, is released when we express or feel gratitude.\nFrom a spiritual aspect, thanksgiving is powerful in furthering the Kingdom of God and building a personal relationship with Christ.\n“I will praise the name of God with a song; I will magnify him with thanksgiving.”\nPsalm 69:30\nThanking God for the blessings he provides and for the ultimate sacrifice of Jesus magnifies Him in our lives and to those around us. We focus on the One from whom every good and perfect gift comes.\nFurthermore, our faith is strengthened when we deeply reflect on God’s many blessings. I am reminded of Moses recounting to the Israelites all the times God provided for them and stayed with them while fleeing Egypt and living in exile (even though they were a stiff-necked people). They were about to enter the Promised Land and go toe-to-toe with the giants and warriors their scouts encountered years ago; a strengthening of faith is what they needed, and often it’s what we need.\nThe best way to develop a thankful spirit is to make a daily habit of gratitude. During an established prayer routine, thank God for his blessings and genuinely reflect on a certain one or two. Gratitude journals can be effective in re-routing a mental negativity slump. Exhaustive gratitude lists, focused gratitude lists, or an assortment of overlooked blessings can improve thankfulness.\nExpress your thanks to God, and the people around you. Write a note, send a text, make a phone call, however you want to do it let someone know you appreciate them! Make Thanksgiving more than just an annual tradition, make it a daily routine to better your health and spirit.","good-for-the-soul#Good for the Soul":"Jokes so corny, they belong between the green bean casserole and the Yams.\nWhy did the mashed potatoes cross the road? To get to the other sides What did the turkey say to the hunter on Thanksgiving? Quack quack What always comes at the end of Thanksgiving? The Letter “G” ","gratitude-in-gods-words#Gratitude in God’s Words":"by Beth B Gratitude is a feeling of thankfulness and appreciation for the good things in life, whether big or small.\n“And he took bread, gave thanks and broke it, and gave it to them …”\nLuke 22:19 NIV\nThanksgiving creates abundance, and the miracle of multiplying happens when I give thanks. Try it when you’re struggling, having a hard day, or your heart is breaking. Make a list of everything you are thankful for from God. The list will be endless….and see what happens, your heart will turn to JOY!\n“He gave thanks” reads “eucharisteo.” The root word of eucharisteo is charis, meaning “grace.” Charis, Grace. Eucharisteo, thanksgiving. Charia, JOY. I love that every Word from God has meaning.\nThere is not a day that goes by where I am not overfilled with gratitude to God for everything comes from Him who loves us.\n“Give Thanks to the Lord of lords. His faithful love endures forever. Give thanks to Him who alone does mighty miracles. His faithful love endures forever. Give thanks to Him who made the heavens so skillfully. His faithful love endures forever. Give thanks to Him who made the heavenly lights— His faithful love endures forever.\"\nPsalm 136:3-5","helping-hands-after-hurricane-helene#Helping Hands after Hurricane Helene":"with Brett F The mountain landscape was punctuated with downed trees, ruined homes, and debris. The devastation was still strikingly apparent. An area he had visited several times before was now the setting of catastrophe following Hurricane Helene. Brett F and a few crewmen from Union County Water traveled to the Asheville and Black Mountain area to assist in re-establishing sewer infrastructure. The crew cleaned up multiple sites for sewer line continuity, located manholes, and redug a manhole.\nDuring excavations and clean-up, various debris was unearthed, but one thing stood out to him. It was a Bible. Caked with mud, he decided to pick it up and give it a closer look. When he opened it, the text was still clearly readable. It was a visual reminder that while the storm has destroyed so much, the Word of God still stands.\nWeeks later using Facebook posts and messages, Brett was able to make contact with the owner of the Bible. They met in a Wal-Mart parking lot in Marion and he handed the Bible over to her. “I had cleaned up that Bible and had it for a week and a half, and I wasn’t even sure if the person who owned it was still alive,” Brett says as he recalls the meeting, “It was a relief to be able to meet her and give her that Bible after seeing so much devastation while we were working up there.”\nThe woman received the Bible when she was saved at the age of 7 as a gift from her grandmother. This woman’s excitement at receiving a treasured copy of God’s Word from the storm’s wreckage is a glimmer of hope amidst despair. God continues to work these small miracles. Anyone can be an instrument for an unexpected blessing; we just have to be willing.\nWe have had numerous other volunteers from our church to deliver supplies and assist in relief efforts. In October, MEBC collected a special offering to benefit the Baptists on Mission Hurricane Helene relief efforts. This mission group has set up large feeding and recovery operations in 14 areas of western North Carolina (WNC). For more information and volunteer and donation opportunities through this organization click here: Baptists on Mission. Our children’s ministry has elected to use shoebox donations and funds to send needed items and gifts to the children of WNC.\n“What good is it, my brothers and sisters, if someone claims to have faith but has no deeds? Can such faith save them? Suppose a brother or a sister is without clothes and daily food. If one of you says to them, “Go in peace; keep warm and well fed,” but does nothing about their physical needs, what good is it? In the same way, faith by itself, if it is not accompanied by action, is dead.“\nJames 2:14-17\nOur willingness to help those in need stems from our faith. Our desire to be like Christ and the testimony of His sacrificial love fuels our good deeds. We are stirred to action, and our deeds testify to His name. Let us continue ministering mightily.\n“By this everyone will know that you are my disciples, if you love one another.\"\nJohn 13:35\nℹ️ We would love to feature others in our church who have provided relief efforts in response to Hurricane Helene. Please contact us at mebc3703@gmail.com with any leads. ","mebc-highlights#MEBC Highlights":"The children did a wonderful job hosting the spaghetti supper on Oct 20th. They raised $1,022 for more supplies and the cost of transporting shoeboxes to the children of WNC! Once packed and prayed over, the boxes will be sent. There is a need for Bibles.\nBaptismal Service We were overjoyed to Witness the baptisms of Sadie F, Tori L, and Ella R. They are each treasured members in the family of believers. May we all do our part in helping them grow in their faith.\nChristmas Play We are gearing up for this year’s Christmas Play set for Dec 15th with soup supper to follow. Practices have started on Wed nights, please let Connie Carter know if you or your child would like to be involved.","thankful-fors#Thankful For’s":"Every night, my daughter and I say our “thankful for’s.” We list aloud all the things for which we thank God. The list always includes family and pets, sometimes teachers and friends, and some things give me an insight into what my toddler treasures. I am often surprised at her appreciation of small things, like leaves and hugs. In the spirit of Thanksgiving, our Sunday School classes tell us their “Thankful For’s”:\nPre-K \u0026 Kindergarten Elephant - Henry Lions \u0026 Dada - Olivia Me! - Lena Food - Roy Jesus dying on the cross - C.J. Flowers - Noah 1st - 2nd Grade I was born Jesus Trees, they give us O₂ Plants, like a rose Youth Family \u0026 Friends My Friends God \u0026 Jesus Saving me Everything! Making me! Faith \u0026 Family My family - Lyndsey My family, friends, \u0026 a job I love A healthy family - the Bakers Family, this church, healthy children, my job - Natalie Family, friends, life, fishing - Brian My salvation, family, my husband \u0026 kids - Magan My husband, my girls, knowing who I am and growing in that - Rachel Salvation, family, my home, healthy kids \u0026 my husband - Connie My family, health, opportunities- Kenneth My family, my salvation, \u0026 my friends Jesus, healthy family \u0026 my home Our family, our church family a roof over our heads and food on our plates, and God - Nick \u0026 Anna My family - Corey Family \u0026 pets - Liz Family - Dillon ","upcoming-events#Upcoming Events":" Brotherhood Breakfast - Nov 24th, 8:00 AM Advent Begins - Dec 1st Christmas Play - Dec 15th, 6:00 PM ","welcome#Welcome":"My dad has started leaving sweet potato recipes laying around the house, a telltale sign that Thanksgiving is near. Our family loves Thanksgiving.\nIn the morning, the guys go rabbit hunting, more aptly called “woods walking,” and the ladies watch the parade and cook.\nIn the afternoon, we sit down for a good meal and a good laugh about the cooking mishaps, like when the turkey caught on fire or the time my mom left the sugar out of the sweet potato pies. We ruminate over the blessings in our lives and recognize God deserves our praise for all things, great and small. I am especially thankful for the church family of MEBC. Thank you to each of you for creating a loving, caring, and comforting community of believers.","wisdom-corner#Wisdom Corner":" “As you therefore have received Christ Jesus the Lord, so walk in Him, rooted and built up in Him and established in the faith, as you have been taught, abounding in it with thanksgiving.\"\nColossians 2:6-7"},"title":"November 2024"},"/hope-harmony/docs/october-2024/":{"data":{"":"","are-you-up-to-the-challenge#Are You Up to the Challenge?":"Every successful organization needs a good understanding of where it is financially and motivationally. Our church has elected to take on the 20/20/20 challenge to focus on meeting budgetary needs and focusing on current and potential ministries we can offer. The basics are on the Sunday closest to the 20th of each month, each member is encouraged to give an additional 20 dollars to their typical giving. That week we are to spend an extra 20 minutes (either all at once or spread throughout the week) praying and listening to God about the ministries of MEBC, and praying for our leadership, vision, and mission.\nHistorically, MEBC has excelled in meeting budgetary needs for day-to-day operations while having funds for stewardship to its members and community. Since COVID, these funds have become tighter. While our church is still able to provide for those in need and does so often, it is important to consider the degree of impact we can have when more than sufficient funds are available. A few benefits highlighted by Pastor Dennis Burton in response to this challenge include bolstering the operating budget, providing more funds for mission projects in the community, providing more funds for current ministries (children’s ministries, activities for families, ministry to home-bound), and provides a solid base from which these ministries can operate. With 20 minutes dedicated to prayer and thoughts focused on the needs of our church and its ministries, the hope is that we will become acutely aware of how we can each play our part in continuing the legacy of a caring, willing, and involved church.","cozy-community-celebration#Cozy Community Celebration":"The evenings are getting cooler, the days are getting shorter, and the leaves are changing—it’s fall! What better way to celebrate this cozy season than with our annual Fall Festival, brimming with warmth and nostalgia? This event offers a chance to fellowship with our church family and welcome our entire community to enjoy the season together.\nMany of us have cherished this festival for years. Some remember attending as children and are now bringing their own kids; others who once brought their children are now enjoying it with grandchildren. Some may be joining for the first time, already planning to return next year. The Fall Festival is a place of fun that embraces all the wonderful aspects of autumn.\nPicture the cozy warmth of huddling together on a hayride, the thrill of playing games and hoping to win a prize, and the joy of seeing young and old sharing smiles and hugs. Personally, I can’t wait for the good old-fashioned cakewalk! Few earthly pleasures compare to hearing your number called when the music stops, then selecting a sweet treat from the table laden with goodies made by our talented bakers. My stomach’s already growling!\nOur church treasures our children and families, and these events highlight that appreciation while extending it to our community. Please invite friends, family, classmates, coworkers, or even that family you often pass in the grocery store. This event is truly for everyone!\nThe Fall Festival will be held on October 26th from 4:30–8:30 PM, primarily in the fellowship hall. We’ll have a prize for the best-decorated pumpkin, which can be either carved or painted. Please bring your crafted pumpkin to the festival, where it will be judged, and the winner announced that night.\nAs mentioned, there will be a cakewalk. If you’re planning to contribute a dessert, please bring it to Alicia Horne in the fellowship hall between 4–7 PM on Friday, October 25th.","food-for-the-soul#Food for the Soul":"Pumpkin Dip Recipe Description A creamy, delicious dip that includes all the tastes of fall.\nIngredients 16 oz cream cheese (softened) 1 can pumpkin puree 1 lb powdered sugar 1 tsp cinnamon 1/2 tsp nutmeg Directions Mix all ingredients with a mixer until well combined. Place in refrigerator to cool. Serve with ginger snaps (to dip). ","fundraising-for-shoeboxes#Fundraising for Shoeboxes":"with Magan L On October 20th, the children’s ministry will host a donation-based spaghetti supper. During this special event, children will help prepare and serve spaghetti, refreshments, and dessert to raise funds for a mission project. The delicious food and sweet service by little hands make this evening a treat for all ages. All donations received will go toward filling and sending “shoeboxes” to those in need.\nOur wonderful church members have donated many items over the past several months. Monetary donations will cover additional items and transportation costs for the boxes. The children’s ministry will send these shoeboxes to children in western North Carolina affected by Hurricane Helene. They’re calling it “Operation Carolina Christmas.”\n“The kids really look forward to this every year”\nMagan L, a leader in the children’s ministry and event organizer, says, “Our goal is for the children receiving these shoeboxes to know there’s everlasting love through Jesus Christ, and that children and people right here in the state love them.” The ministry leaders also hope MEBC children will learn they can share God’s love in many places, whether across the world or right here in North Carolina.\nLast year’s event raised about $1,000, so this mission is expected to have a significant impact. “The kids really look forward to this every year,” says Magan, and it’s safe to say we all do.\nThe event will begin at 5:30 pm in the MEBC fellowship hall; donations are appreciated. Items for shoeboxes will be collected until the end of October. If you can’t attend but would like to make a monetary donation, please contact Magan L.","mebc-highlights#MEBC Highlights":"Workday Thank you to all who came out to help with our church workday! Caring for the beauty of our church is a reflection of the care we have for one another, and our drive to reach our community.\nDeaf Ministry Deaf Sunday school and deaf church will begin on October 20th. Sunday school will be held at 9:45 AM and service at 10:45 with Rev Nathan C. These will be held in the fellowship hall.","trunk-or-treat#Trunk or Treat":"On October 31st, MEBC is hosting a Trunk or Treat event in the upper parking lot (outside the Sanctuary). Those planning to host from their “trunk” should arrive and park by 6:00 PM. Trick-or-treating begins at 6:30 PM, with the lot closing to cars at 6:25 PM. The lower lot will remain open for event attendees.\nProviding a safe, family-friendly alternative for our community’s children is important to us. We encourage you to invite all children to attend. Last year, we saw fantastic costumes, fun games, and creative trunks—we’re excited to see what this year brings! This event allows families to experience our welcoming community and may inspire them to consider attending our church. Remember, sharing God’s love and His ministry is the true purpose behind everything we do.","upcoming-events#Upcoming Events":" Ladies Supper \u0026 Devotional - October 18, 6:00 PM Baptismal Service - October 20, 11:00 AM Deaf Church - October 20, 9:45 \u0026 10:45 AM Spaghetti Supper - October 20, 5:30 PM Fall Festival - October 26, 4:30 PM Men’s Breakfast - October 27, 8:00 AM Trunk or Treat - October 31, 6:30 PM ","welcome#Welcome":"Hello and welcome to our first issue of Mary Elizabeth Baptist Church’s (MEBC) newsletter. We are excited about this opportunity to promote communication and involvement within our church family \u0026 community. Our goals for this newsletter are to bring awareness of our ministries and missions, create a feeling of community among members, and bring joy and connection to all of our readers. We hope this regular publication brings a breath of fresh air to your mailbox or inbox, as well as the content to keep you informed about our church and in touch with the Spirit. Newsletters will feature interviews, guest authors, event calendars, and “Food for the Soul,” a section devoted to bringing inspiration and a smile.","wisdom-center#Wisdom Center":" “Finally, brothers and sisters, rejoice! Strive for full restoration, encourage one another, be of one mind, live in peace. And the God of love and peace will be with you.”\n2 Corinthians 13:11"},"title":"October 2024"}}